// Winki.Task_Cpp.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cstdlib>

using namespace std;

int main()
{
    system("chcp 1251 > nul");

    int n = 0;
    int s = 0;
    int a = 0;

    while (true)
    {
        cout << "Введите число: ";
        cin >> n;

        s += n;
        a++;

        char symbol;

        cout << "Вы закончили ввод? (y / n): ";
        cin >> symbol;

        if (symbol == 'y' || symbol == 'Y') break;
    }

    cout << endl;

    cout << "Сумма чисел, которые Вы ввели: " <<  s << endl;
    cout << "Среднее арифметическое чисел, которые Вы ввели: " << (s / a) << endl;

    system("pause > nul");

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
